<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°03

## Objetivos de la clase

* Reforzar los conceptos básicos de pandas.

## Contenidos

* [Problema 01](#p1)

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [2]:
import pandas as pd
import os

In [3]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|").set_index('user_id')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. ¿Cuál es el número de observaciones en el conjunto de datos?

In [38]:

a=df.shape

print("Hay "+str(a[0])+" datos")

Hay
943
datos
Hay 943 datos

2. ¿Cuál es el número de columnas en el conjunto de datos?

In [39]:

a=df.shape

print("Hay "+str(a[1])+" columnas")

Hay 4 datos

3. Imprime el nombre de todas las columnas

In [42]:
df.columns
print("el nombre de las columnas son:")
for x in df.columns:
    print(x)

el nombre de las columnas son:
age
gender
occupation
zip_code

4. Imprima el índice del dataframe

In [43]:
df.index.to_frame()

         user_id
user_id
1              1
2              2
3              3
4              4
5              5
...          ...
939          939
940          940
941          941
942          942
943          943

[943 rows x 1 columns]

5. ¿Cuál es el tipo de datos de cada columna?

6. Resumir el conjunto de datos

In [50]:
df.dtypes.to_frame()

                 0
age          int64
gender      object
occupation  object
zip_code    object

In [5]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

7. Resume conjunto de datos  con todas las columnas

In [6]:
df.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

8. Imprimir solo la columna de **occupation**.

In [13]:
df.describe(include="all").occupation

count         943
unique         21
top       student
freq          196
mean          NaN
std           NaN
min           NaN
25%           NaN
50%           NaN
75%           NaN
max           NaN
Name: occupation, dtype: object

9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [44]:
print("hay "+str(df.describe(include="all").occupation.loc["unique"])+" ocupaciones diferentes")

hay 21 ocupaciones diferentes

10. ¿Cuál es la ocupación más frecuente?

In [47]:
print("la ocupacion mas frecuente es la de "+str(df.describe(include="all").occupation.loc["top"]))

la ocupacion mas frecuente es la de student

11. ¿Cuál es la edad media de los usuarios?

In [48]:
print("La media de los usuarios es:"+str(df.describe(include="all").age.loc["mean"]))

La media de los usuarios es:34.05196182396607

12. ¿Cuál es la edad con menos ocurrencia?

In [49]:
print("las edades con menos ocurrencias son:")
ms=df[["age"]].value_counts() 
inf=ms.min()
mask = (ms == inf)
ms[mask].to_frame()

las edades con menos ocurrencias son:

     0
age
11   1
10   1
73   1
66   1
7    1